Tekla Open API Reference for Tekla Structures 2025
PourObject.GetAssembly Method
Note: This API is now obsolete.
 Returns the assembly that the pour object belongs to.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute]
public Assembly GetAssembly()
<ObsoleteAttribute>
Public Function GetAssembly As Assembly
Return Value
Type: Assembly
The assembly that the pour object belongs to.
Implements
IAssemblable.GetAssembly()
See Also
Reference
PourObject Class
Tekla.Structures.Model Namespace